.TH AMRECOVER 8 "29 November 1996" "Alan M. McIvor" "AMANDA INDEX" \" -*- nroff -*-
.de CP
.ie '\\$3'' \\fB\\$1\\fP \\fI\\$2\\fP
.el .ie '\\$2'' \\fB\\$1\\fP [ \\fI\\$3\\fP ]
.el \\fB\\$1\\fP \\fI\\$2\\fP [ \\fI\\$3\\fP ]
..
.de EX
.if t .ft C
.nf
..
.de EE
.fi
.if t .ft
..
.SH NAME
amrecover \- Amanda index database browser
.SH SYNOPSIS
.B amrecover
[
[
.B \-C
]
.I config
]
[
.B \-s
.I index-server
]
[
.B \-t
.I tape-server
]
[
.B \-d
.I tape-device
]
.SH DESCRIPTION
.B Amrecover
browses the database of Amanda index files to determine which tapes
contain files to recover.  Furthermore, it is able to recover files.
.LP
In order to restore files in place, you must invoke
.BR amrecover
from the root of the backed up filesystem, or use
.BR lcd
to move into that directory, otherwise a directory tree that resembles 
the backed up filesystem will be created in the current directory.
See the examples below for details.
.LP
See the
.IR amanda (8)
man page for more details about Amanda.
.SH OPTIONS
.TP
.CP "[ -C ]" config
Amanda configuration
(default: @DEFAULT_CONFIG@).
.TP
.CP -s index-server
Host that runs the index daemon
(default: @DEFAULT_SERVER@).
.TP
.CP -t tape-server
Host that runs the tape server daemon
(default: @DEFAULT_TAPE_SERVER@).
.TP
.CP -d tape-device
Tape device to use on the tape server host
(default: @DEFAULT_TAPE_DEVICE@).
.SH COMMANDS
.B Amrecover
connects to the index server and then presents a command line prompt.
Usage is similar to an ftp client.
The GNU readline library is used to provide command line history and editing
if it was built in to
.BR amrecover .
.LP
The purpose of browsing the database is to build up a
.I restore list
of files to be extracted from the backup system.
The following commands are available:
.TP
.CP sethost hostname
Specifies which host to look at backup files for
(default: the local host).
.TP
.CP setdate YYYY-MM-DD
Set the date
(default: today).
File listing commands only return information on
backup images for this day,
for the day before with the next lower dump level,
and so on,
until the most recent level 0 backup on or before
the specified date is encountered.
.IP
For example, if:
.LP
.RS
.RS
.nf
1996-07-01 was a level 0 backup
1996-07-02 through 1996-07-05 were level 1 backups
1996-07-06 through 1997-07-08 were level 2 backups
.fi
.RE
.RE
.IP
then if 1997-07-08 is the requested date,
files from the following days would be used:
.LP
.RS
.RS
.nf
1997-07-08 (the latest level 2 backup)
1997-07-05 (the latest level 1 backup)
1997-07-01 (the latest level 0 backup)
.fi
.RE
.RE
.IP
Only the most recent version of a file will be presented.
.IP
The following abbreviated date specifications are accepted:
.RS
.RS
.TP
.I --MM-DD
dates in the current year
.TP
.I ---DD
dates in the current month of the current year
.RE
.RE
.TP
.CP setdisk diskname mountpoint
Specifies which disk to consider
(default: the disk holding the working directory where
.B amrecover
is started).
It can only be set after the host is set with
.BR sethost .
.I Diskname
is the device name specified in the
.I amanda.conf
or
.I disklist
configuration file.
The disk must be local to the host.
If
.I mountpoint
is not specified, all pathnames will be relative to the (unknown)
mount point instead of full pathnames.
.TP
.CP listdisk [diskdevice]
List all
.B diskname
.TP
.CP settape [[server]:][tapedev|default]
Specifies the host to use as the tape server, and which of its tape
devices to use.
If the server is omitted, but the colon is not, the
server name reverts to @DEFAULT_TAPE_SERVER@, the configure-time
default.
If the tape device is omitted, it remains unchanged.
To use the default tape device selected by the tape server, the word
.I default
must be specified.
If no argument is specified, or the argument is an
empty string, no changes occur, and the current settings are
displayed.
.IP
If you want amrecover to use your changer, the 
.I tapedev
must be equal to the amrecover_changer setting on the server.
.IP
If you need to change the protocol (tape:, rait:, file:, null:) then you
must specify the hostname.
.LP
.RS
.RS
.nf
settape @DEFAULT_TAPE_SERVER@:file:/file1
.fi
.RE
.RE
.IP
You can change the tape device when amrecover ask you to load the tape:
.LP
.RS
.RS
.nf
Load tape DMP014 now
Continue? [Y/n/t]: t
Tape device: server2:/dev/nst2
Continue? [Y/n/t]: Y
Using tape /dev/nst2 from server server2.
.fi
.RE
.RE
.IP
.TP
.CP setmode mode
Set the extraction mode for Samba shares.
If
.I mode
is
.BR smb ,
shares are sent to the Samba server
to be restored back onto the PC.
If
.I mode
is
.BR tar ,
they are extracted on the local machine the same way tar volumes are extracted.
.TP
.CP mode
Displays the extracting mode for Samba shares.
.TP
.CP history
Show the backup history of the current host and disk.
Dates, levels, tapes and file position on tape of each backup are displayed.
.TP
.CP pwd
Display the name of the current backup working directory.
.TP
.CP cd dir
Change the backup working directory to
.I dir.
If the mount point was specified with
.BR setdisk ,
this can be a full pathname or it can be
relative to the current backup working directory.
If the mount point was not specified,
paths are relative to the mount point if they start with "/",
otherwise they are relative to the current backup working directory.
The
.I dir
can be a shell style wildcards.
.TP
.CP cdx dir
Like the
.B cd
command but allow regular expression.
.TP
.CP lpwd
Display the
.B amrecover
working directory.
Files will be restored under this directory,
relative to the backed up filesystem.
.TP
.CP lcd path
Change the
.B amrecover
working directory to
.IR path .
.TP
.CP ls
List the contents of the current backup working directory.
See the description of the
.B setdate
command for how the view of the
directory is built up.
The backup date is shown for each file.
.TP
.CP add item1 "item2 ..."
Add the specified files or directories to the restore list.
Each item may have shell style wildcards.
.TP
.CP addx item1 "item2 ..."
Add the specified files or directories to the restore list.
Each item may be a regular expression.
.TP
.CP delete item1 "item2 ..."
Delete the specified files or directories from the restore list.
Each item may have shell style wildcards.
.TP
.CP deletex item1 "item2 ..."
Delete the specified files or directories from the restore list.
Each item may be a regular expression.
.TP
.CP list "" file
Display the contents of the restore list.
If a file name is specified,
the restore list is written to that file.
This can be used to manually extract the files from the Amanda tapes with
.BR amrestore .
.TP
.CP clear
Clear the restore list.
.TP
.CP quit
Close the connection to the index server and exit.
.TP
.CP exit
Close the connection to the index server and exit.
.TP
.CP extract
Start the extract sequence (see the examples below).  Make sure the
local working directory is the root of the backed up filesystem, or
another directory that will behave like that.  Use
.BR lpwd
to display the local working directory, and
.BR lcd
to change it.
.TP
.CP help
Display a brief list of these commands.
.SH EXAMPLES
The following shows the recovery of an old
.I syslog
file.
.LP
.RS
.EX
# cd /var/log
# ls -l syslog.7
syslog.7: No such file or directory
# amrecover
AMRECOVER Version 2.4.2. Contacting server on @DEFAULT_SERVER@ ...
220 @DEFAULT_SERVER@ AMANDA index server (2.4.2) ready.
Setting restore date to today (1997-12-09)
200 Working date set to 1997-12-09.
200 Config set to @DEFAULT_CONFIG@.
200 Dump host set to this-host.some.org.
$CWD '/var/log' is on disk '/var' mounted at '/var'.
200 Disk set to /var.
/var/log
WARNING: not on root of selected filesystem, check man-page!
amrecover> ls
1997-12-09 daemon.log
1997-12-09 syslog
1997-12-08 authlog
1997-12-08 sysidconfig.log
1997-12-08 syslog.0
1997-12-08 syslog.1
1997-12-08 syslog.2
1997-12-08 syslog.3
1997-12-08 syslog.4
1997-12-08 syslog.5
1997-12-08 syslog.6
1997-12-08 syslog.7
amrecover> add syslog.7
Added /log/syslog.7
amrecover> lpwd
/var/log
amrecover> lcd ..
/var
amrecover> extract

Extracting files using tape drive @DEFAULT_TAPE_DEVICE@ on host @DEFAULT_TAPE_SERVER@

The following tapes are needed: DMP014

Restoring files into directory /var
Continue? [Y/n]: y

Load tape DMP014 now
Continue? [Y/n/t]: y
set owner/mode for '.'? [yn] n
amrecover> quit
200 Good bye.
# ls -l syslog.7
total 26
-rw-r--r--   1 root     other      12678 Oct 14 16:36 syslog.7
.EE
.RE
.LP
If you do not want to overwrite existing files,
create a subdirectory to run
.B amrecover
from and then move the restored files afterward.
.LP
.RS
.EX
# cd /var
# (umask 077 ; mkdir .restore)
# cd .restore
# amrecover
AMRECOVER Version 2.4.2. Contacting server on @DEFAULT_SERVER@ ...
\&...
amrecover> cd log
/var/log
amrecover> ls
\&...
amrecover> add syslog.7
Added /log/syslog.7
amrecover> lpwd
/var/.restore
amrecover> extract

Extracting files using tape drive @DEFAULT_TAPE_DEVICE@ on host @DEFAULT_TAPE_SERVER@
\&...
amrecover> quit
200 Good bye.
# mv -i log/syslog.7 ../log/syslog.7-restored
# cd ..
# rm -fr .restore
.EE
.RE
.LP
If you need to run
.B amrestore
by hand instead of letting
.B amrecover
control it,
use the
.B list
command after browsing to display the needed tapes.
.LP
.RS
.EX
# cd /var/log
# amrecover
AMRECOVER Version 2.4.2. Contacting server on @DEFAULT_SERVER@ ...
\&...
amrecover> ls
\&...
amrecover> add syslog syslog.6 syslog.7
Added /log/syslog
Added /log/syslog.6
Added /log/syslog.7
amrecover> list
TAPE DMP014 LEVEL 0 DATE 1997-12-08
        /log/syslog.7
        /log/syslog.6
TAPE DMP015 LEVEL 1 DATE 1997-12-09
        /log/syslog
amrecover> quit
.EE
.RE
.LP
The
.B history
command shows each tape that has a backup of the
current disk along with the date of the backup,
the level,
the tape label
and the file position on the tape.
All active tapes are listed, not just back to
the most recent full dump.
.LP
Tape file position zero is a label.
The first backup image is in file position one.
.LP
.RS
.EX
# cd /var/log
# amrecover
AMRECOVER Version 2.4.2. Contacting server on @DEFAULT_SERVER@ ...
\&...
amrecover> history
200- Dump history for config "@DEFAULT_CONFIG@" host "this-host.some.org" disk "/var"
201- 1997-12-09 1 DMP015 9
201- 1997-12-08 1 DMP014 11
201- 1997-12-07 0 DMP013 22
201- 1997-12-06 1 DMP012 16
201- 1997-12-05 1 DMP011 9
201- 1997-12-04 0 DMP010 11
201- 1997-12-03 1 DMP009 7
201- 1997-12-02 1 DMP008 7
201- 1997-12-01 1 DMP007 9
201- 1997-11-30 1 DMP006 6
\&...
amrecover> quit
.EE
.RE
.SH ENVIRONMENT
.LP
.B PAGER
.RS
The 
.B ls
and 
.B list
commands will use $PAGER to display the file lists.
Defaults to
.I more
if PAGER is not set.
.RE
.SH AUTHOR
Alan M. McIvor <alan@kauri.auck.irl.cri.nz>
.SH "SEE ALSO"
amanda(8),
amrestore(8),
readline(3)
