.\"Generated by db2man.xsl. Don't modify this, modify the source.
.de Sh \" Subsection
.br
.if t .Sp
.ne 5
.PP
\fB\\$1\fR
.PP
..
.de Sp \" Vertical space (when we can't use .PP)
.if t .sp .5v
.if n .sp
..
.de Ip \" List item
.br
.ie \\n(.$>=3 .ne \\$3
.el .ne 3
.IP "\\$1" \\$2
..
.TH "AMRECOVER" 8 "" "" ""
.SH NAME
amrecover \- AMANDA index database browser
.SH "SYNOPSIS"
.ad l
.hy 0
.HP 10
\fBamrecover\fR [[\-C]\ \fIconfig\fR] [\-s\ \fIindex\-server\fR] [\-t\ \fItape\-server\fR] [\-d\ \fItape\-device\fR]
.ad
.hy

.SH "DESCRIPTION"

.PP
\fBAmrecover\fR browses the database of \fBAMANDA\fR index files to determine which tapes contain files to recover\&. Furthermore, it is able to recover files\&.

.PP
In order to restore files in place, you must invoke \fBamrecover\fR from the root of the backed up filesystem, or use \fBlcd\fR to move into that directory, otherwise a directory tree that resembles the backed up filesystem will be created in the current directory\&. See the examples below for details\&.

.PP
See the \fBamanda\fR(8) man page for more details about \fBAMANDA\fR\&.

.SH "OPTIONS"

.RS
.Sh "Note"
The listed defaults map to the values you ran the configure\-script with\&.
.RE

.TP
\fB[ \-C ] config\fR
\fBAMANDA\fR configuration (default: daily)\&.

.TP
\fB\-s index\-server\fR
Host that runs the index daemon (default: oops)\&.

.TP
\fB\-t tape\-server\fR
Host that runs the tape server daemon (default: 192\&.168\&.0\&.10)\&.

.TP
\fB\-d tape\-device\fR
Tape device to use on the tape server host (default: /dev/nst0)\&.

.SH "COMMANDS"

.PP
\fBAmrecover\fR connects to the index server and then presents a command line prompt\&. Usage is similar to an ftp client\&. The GNU readline library is used to provide command line history and editing if it was built in to \fBamrecover\fR\&.

.PP
The purpose of browsing the database is to build up a \fBrestore list\fR of files to be extracted from the backup system\&. The following commands are available:

.TP
\fBsethost hostname\fR
Specifies which host to look at backup files for (default: the local host)\&.

.TP
\fBsetdate YYYY\-MM\-DD\fR
Set the date (default: today)\&. File listing commands only return information on backup images for this day, for the day before with the next lower dump level, and so on, until the most recent level 0 backup on or before the specified date is encountered\&.

For example, if:


.nf

1996\-07\-01 was a level 0 backup
1996\-07\-02 through 1996\-07\-05 were level 1 backups
1996\-07\-06 through 1997\-07\-08 were level 2 backups

.fi
then if 1997\-07\-08 is the requested date, files from the following days would be used:


.nf

1997\-07\-08 (the latest level 2 backup)
1997\-07\-05 (the latest level 1 backup)
1997\-07\-01 (the latest level 0 backup)

.fi
Only the most recent version of a file will be presented\&.

The following abbreviated date specifications are accepted:

.RS

.TP
\fB\-\-MM\-DD\fR
dates in the current year

.TP
\fB\-\-\-DD\fR
dates in the current month of the current year

.RE
.IP

.TP
\fBsetdisk diskname mountpoint\fR
Specifies which disk to consider (default: the disk holding the working directory where \fBamrecover\fR is started)\&. It can only be set after the host is set with \fBsethost\fR\&. \fBDiskname\fR is the device name specified in the \fBamanda\&.conf\fR or \fBdisklist\fR configuration file\&. The disk must be local to the host\&. If \fBmountpoint\fR is not specified, all pathnames will be relative to the (unknown) mount point instead of full pathnames\&.

.TP
\fBlistdisk [diskdevice]\fR
List all \fBdiskname\fR

.TP
\fBsettape [[server]:][tapedev|default]\fR
Specifies the host to use as the tape server, and which of its tape devices to use\&. If the server is omitted, but the colon is not, the server name reverts to 192\&.168\&.0\&.10, the configure\-time default\&. If the tape device is omitted, it remains unchanged\&. To use the default tape device selected by the tape server, the word \fBdefault\fR must be specified\&. If no argument is specified, or the argument is an empty string, no changes occur, and the current settings are displayed\&.

If you want amrecover to use your changer, the \fBtapedev\fR must be equal to the amrecover_changer setting on the server\&.

If you need to change the protocol (tape:, rait:, file:, null:) then you must specify the hostname\&.

.nf

settape 192\&.168\&.0\&.10:file:/file1
.fi
You can change the tape device when amrecover ask you to load the tape:
.nf

Load tape DMP014 now
Continue? [Y/n/t]: t
Tape device: server2:/dev/nst2
Continue? [Y/n/t]: Y
Using tape /dev/nst2 from server server2\&.
.fi

.TP
\fBsetmode mode\fR
Set the extraction mode for Samba shares\&. If \fBmode\fR is \fBsmb\fR, shares are sent to the Samba server to be restored back onto the PC\&. If \fBmode\fR is \fBtar\fR, they are extracted on the local machine the same way tar volumes are extracted\&.

.TP
\fBmode\fR
Displays the extracting mode for Samba shares\&.

.TP
\fBhistory\fR
Show the backup history of the current host and disk\&. Dates, levels, tapes and file position on tape of each backup are displayed\&.

.TP
\fBpwd\fR
Display the name of the current backup working directory\&.

.TP
\fBcd dir\fR
Change the backup working directory to \fBdir\&.\fR If the mount point was specified with \fBsetdisk\fR, this can be a full pathname or it can be relative to the current backup working directory\&. If the mount point was not specified, paths are relative to the mount point if they start with "/", otherwise they are relative to the current backup working directory\&. The \fBdir\fR can be a shell style wildcards\&.

.TP
\fBcdx dir\fR
Like the \fBcd\fR command but allow regular expression\&.

.TP
\fBlpwd\fR
Display the \fBamrecover\fR working directory\&. Files will be restored under this directory, relative to the backed up filesystem\&.

.TP
\fBlcd path\fR
Change the \fBamrecover\fR working directory to \fBpath\fR\&.

.TP
\fBls\fR
List the contents of the current backup working directory\&. See the description of the \fBsetdate\fR command for how the view of the directory is built up\&. The backup date is shown for each file\&.

.TP
\fBadd item1 item2 \&.\&.\&.\fR
Add the specified files or directories to the restore list\&. Each item may have shell style wildcards\&.

.TP
\fBaddx item1 item2 \&.\&.\&.\fR
Add the specified files or directories to the restore list\&. Each item may be a regular expression\&.

.TP
\fBdelete item1 item2 \&.\&.\&.\fR
Delete the specified files or directories from the restore list\&. Each item may have shell style wildcards\&.

.TP
\fBdeletex item1 item2 \&.\&.\&.\fR
Delete the specified files or directories from the restore list\&. Each item may be a regular expression\&.

.TP
\fBlist file\fR
Display the contents of the restore list\&. If a file name is specified, the restore list is written to that file\&. This can be used to manually extract the files from the \fBAMANDA\fR tapes with \fBamrestore\fR\&.

.TP
\fBclear\fR
Clear the restore list\&.

.TP
\fBquit\fR
Close the connection to the index server and exit\&.

.TP
\fBexit\fR
Close the connection to the index server and exit\&.

.TP
\fBextract\fR
Start the extract sequence (see the examples below)\&. Make sure the local working directory is the root of the backed up filesystem, or another directory that will behave like that\&. Use \fBlpwd\fR to display the local working directory, and \fBlcd\fR to change it\&.

.TP
\fBhelp\fR
Display a brief list of these commands\&.

.SH "EXAMPLES"

.PP
The following shows the recovery of an old \fBsyslog\fR file\&.
.nf

# cd /var/log
# ls \-l syslog\&.7
syslog\&.7: No such file or directory
# amrecover
AMRECOVER Version 2\&.4\&.2\&. Contacting server on oops \&.\&.\&.
220 oops \fBAMANDA\fR index server (2\&.4\&.2) ready\&.
Setting restore date to today (1997\-12\-09)
200 Working date set to 1997\-12\-09\&.
200 Config set to daily\&.
200 Dump host set to this\-host\&.some\&.org\&.
$CWD '/var/log' is on disk '/var' mounted at '/var'\&.
200 Disk set to /var\&.
/var/log
WARNING: not on root of selected filesystem, check man\-page!
amrecover> ls
1997\-12\-09 daemon\&.log
1997\-12\-09 syslog
1997\-12\-08 authlog
1997\-12\-08 sysidconfig\&.log
1997\-12\-08 syslog\&.0
1997\-12\-08 syslog\&.1
1997\-12\-08 syslog\&.2
1997\-12\-08 syslog\&.3
1997\-12\-08 syslog\&.4
1997\-12\-08 syslog\&.5
1997\-12\-08 syslog\&.6
1997\-12\-08 syslog\&.7
amrecover> add syslog\&.7
Added /log/syslog\&.7
amrecover> lpwd
/var/log
amrecover> lcd \&.\&.
/var
amrecover> extract

Extracting files using tape drive /dev/nst0 on host 192\&.168\&.0\&.10

The following tapes are needed: DMP014

Restoring files into directory /var
Continue? [Y/n]: y

Load tape DMP014 now
Continue? [Y/n/t]: y
set owner/mode for '\&.'? [yn] n
amrecover> quit
200 Good bye\&.
# ls \-l syslog\&.7
total 26
\-rw\-r\-\-r\-\-   1 root     other      12678 Oct 14 16:36 syslog\&.7
.fi

.PP
If you do not want to overwrite existing files, create a subdirectory to run \fBamrecover\fR from and then move the restored files afterward\&.
.nf

# cd /var
# (umask 077 ; mkdir \&.restore)
# cd \&.restore
# amrecover
AMRECOVER Version 2\&.4\&.2\&. Contacting server on oops \&.\&.\&.
\&.\&.\&.
amrecover> cd log
/var/log
amrecover> ls
\&.\&.\&.
amrecover> add syslog\&.7
Added /log/syslog\&.7
amrecover> lpwd
/var/\&.restore
amrecover> extract

Extracting files using tape drive /dev/nst0 on host 192\&.168\&.0\&.10
\&.\&.\&.
amrecover> quit
200 Good bye\&.
# mv \-i log/syslog\&.7 \&.\&./log/syslog\&.7\-restored
# cd \&.\&.
# rm \-fr \&.restore
.fi

.PP
If you need to run \fBamrestore\fR by hand instead of letting \fBamrecover\fR control it, use the \fBlist\fR command after browsing to display the needed tapes\&.
.nf

# cd /var/log
# amrecover
AMRECOVER Version 2\&.4\&.2\&. Contacting server on oops \&.\&.\&.
\&.\&.\&.
amrecover> ls
\&.\&.\&.
amrecover> add syslog syslog\&.6 syslog\&.7
Added /log/syslog
Added /log/syslog\&.6
Added /log/syslog\&.7
amrecover> list
TAPE DMP014 LEVEL 0 DATE 1997\-12\-08
        /log/syslog\&.7
        /log/syslog\&.6
TAPE DMP015 LEVEL 1 DATE 1997\-12\-09
        /log/syslog
amrecover> quit 
.fi

.PP
The \fBhistory\fR command shows each tape that has a backup of the current disk along with the date of the backup, the level, the tape label and the file position on the tape\&. All active tapes are listed, not just back to the most recent full dump\&.

.PP
Tape file position zero is a label\&. The first backup image is in file position one\&.
.nf

# cd /var/log
# amrecover
AMRECOVER Version 2\&.4\&.2\&. Contacting server on oops \&.\&.\&.
\&.\&.\&.
amrecover> history
200\- Dump history for config "daily" host "this\-host\&.some\&.org" disk "/var"
201\- 1997\-12\-09 1 DMP015 9
201\- 1997\-12\-08 1 DMP014 11
201\- 1997\-12\-07 0 DMP013 22
201\- 1997\-12\-06 1 DMP012 16
201\- 1997\-12\-05 1 DMP011 9
201\- 1997\-12\-04 0 DMP010 11
201\- 1997\-12\-03 1 DMP009 7
201\- 1997\-12\-02 1 DMP008 7
201\- 1997\-12\-01 1 DMP007 9
201\- 1997\-11\-30 1 DMP006 6
\&.\&.\&.
amrecover> quit 
.fi

.SH "ENVIRONMENT"

.PP
\fBPAGER\fR   The \fBls\fR and \fBlist\fR commands will use $PAGER to display the file lists\&. Defaults to \fBmore\fR if PAGER is not set\&.

.SH "AUTHOR"

.PP
Alan M\&. McIvor <alan@kauri\&.auck\&.irl\&.cri\&.nz> : Original text

.PP
Stefan G\&. Weichinger, <sgw@amanda\&.org>, maintainer of the \fBAMANDA\fR\-documentation: XML\-conversion

.SH "SEE ALSO"

.PP
\fBamanda\fR(8), \fBamrestore\fR(8), \fBreadline\fR(3)

